<?php

return [

    /*
    |--------------------------------------------------------------------------
    | API Debugger Enabled
    |--------------------------------------------------------------------------
    */
    'enabled' => (bool) env('APP_API_DEBUGGER', true),

    /*
    |--------------------------------------------------------------------------
    | Response key
    |--------------------------------------------------------------------------
    |
    | Ключ у JSON відповіді, під яким буде лежати debug data.
    | Наприклад:
    |   'debugger' => [...]
    |
    */
    'response_key' => env('API_DEBUGGER_RESPONSE_KEY', 'debugger'),


    /*
    |--------------------------------------------------------------------------
    | Excepted paths
    |--------------------------------------------------------------------------
    | Supports wildcard (*)
    |
    | Examples:
    | - api/health
    | - api/auth/*
    |
    */
    'except' => [

    ],
];